app/views/users/index.html.erb

SELECT "users".* FROM "users" WHERE (preco like 'asdasd')
---
<h1>Jogadores:</h1>
<% @users = User.search(params[:search]) %>