app/views/users/list.html.erb

<h1>Jogadores:</h1>
<% @users = User.all %>
---
SELECT "users".* FROM "users"